---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LayerElemCompoundElemFamily
source: html/2aa375d7-0b18-470b-b105-a2dfa3004dcb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LayerElemCompoundElemFamily Property

"Compound Element Family"

## Syntax (C#)
```csharp
public static ForgeTypeId LayerElemCompoundElemFamily { get; }
```